EDT/УТ/src/Catalogs/зпБрейки/зпБрейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпБрейки</name>
  <owners>Catalog.зпСхемыБрейков</owners>
  <tabularSections>
    <name>ГраницыБрейка</name>
    <attributes>
      <name>ЗначениеОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/зпМинимальныеСтавки/зпМинимальныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпМинимальныеСтавки</name>
  <resources>
    <name>МинимальнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМинимальнойСтавки</name>
    <type>
      <types>EnumRef.зпВидыМинимальныхСтавок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкОтработанныхДней</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкМинимальногоПроцентаВыполнения</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкМинимальногоПробегаПоРейсу</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/зпБрейки/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Брейк", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.зпМинимальныеСтавки КАК зпМинимальныеСтавки
		|ГДЕ
		|	зпМинимальныеСтавки.БрейкОтработанныхДней = &Брейк
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.зпМинимальныеСтавки КАК зпМинимальныеСтавки
		|ГДЕ
		|	зпМинимальныеСтавки.БрейкМинимальногоПроцентаВыполнения = &Брейк";
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			Сообщить("Редактирование запрещено");
			Сообщить("Обнаружены данные по Брейку!");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
